FelipeCorso/PIC18F4620-batalha-naval/batalha_naval.c
void initPortaAvioes() {
    unsigned int i = 0;
    unsigned int linha = 0;
    unsigned int coluna = 0;
    unsigned int posicaoValida = 0;

    linha = getPosicao();
    coluna = getPosicao();
    posicaoValida = isPosicaoValida(&linha, &coluna, porta_avioes_posicoes);
    while (!posicaoValida) {
        posicaoValida = isPosicaoValida(&linha, &coluna, porta_avioes_posicoes);
    }

    for (i = 0; i < porta_avioes_posicoes; i++) {
        porta_avioes[0].posicoes[i].lin = linha;
        porta_avioes[0].posicoes[i].col = coluna;
        porta_avioes[0].posicoes[i].acertou = 0;
        //escreverMatriz(linha, coluna, '0');
        escreverMatriz(linha, i, 'p');
    }
}

void initHidroavioes() {
    unsigned int i = 0;
    unsigned int j = 0;
    unsigned int linha = 0;
    unsigned int coluna = 0;
    unsigned int posicaoValida = 0;

    linha = getPosicao();
    coluna = getPosicao();
    posicaoValida = isPosicaoValida(&linha, &coluna, hidroavioes_posicoes);
    while (!posicaoValida) {
        posicaoValida = isPosicaoValida(&linha, &coluna, hidroavioes_posicoes);
    }

    for (i = 0; i < hidroavioes_qtd; i++) {
        for (j = 0; j < hidroavioes_posicoes; j++) {
            hidroavioes[i].posicoes[j].lin = linha;
            hidroavioes[i].posicoes[j].col = coluna;
            hidroavioes[i].posicoes[j].acertou = 0;
            //escreverMatriz(linha, coluna, '0');
            escreverMatriz(linha, coluna, 'h');
            coluna++;
        }

        if ((i + 1) < hidroavioes_qtd) {
            linha = getPosicao();
            coluna = getPosicao();
            posicaoValida = isPosicaoValida(&linha, &coluna, hidroavioes_posicoes);
            while (!posicaoValida) {
                posicaoValida = isPosicaoValida(&linha, &coluna, hidroavioes_posicoes);
            }
        }
    }
}

void initSubmarinos() {
    unsigned int i = 0;
    unsigned int j = 0;
    unsigned int linha = 0;
    unsigned int coluna = 0;
    unsigned int posicaoValida = 0;

    linha = getPosicao();
    coluna = getPosicao();
    posicaoValida = isPosicaoValida(&linha, &coluna, submarinos_posicoes);
    while (!posicaoValida) {
        posicaoValida = isPosicaoValida(&linha, &coluna, submarinos_posicoes);
    }

    for (i = 0; i < submarinos_qtd; i++) {
        for (j = 0; j < submarinos_posicoes; j++) {
            submarinos[i].posicoes[j].lin = linha;
            submarinos[i].posicoes[j].col = coluna;
            submarinos[i].posicoes[j].acertou = 0;
            //escreverMatriz(linha, coluna, '0');
            escreverMatriz(linha, coluna, 's');
            coluna++;
        }

        if ((i + 1) < submarinos_qtd) {
            linha = getPosicao();
            coluna = getPosicao();
            posicaoValida = isPosicaoValida(&linha, &coluna, submarinos_posicoes);
            while (!posicaoValida) {
                posicaoValida = isPosicaoValida(&linha, &coluna, submarinos_posicoes);
            }
        }
    }
}

void initCruzadores() {
    unsigned int i = 0;
    unsigned int j = 0;
    unsigned int linha = 0;
    unsigned int coluna = 0;
    unsigned int posicaoValida = 0;

    linha = getPosicao();
    coluna = getPosicao();
    posicaoValida = isPosicaoValida(&linha, &coluna, cruzadores_posicoes);
    while (!posicaoValida) {
        posicaoValida = isPosicaoValida(&linha, &coluna, cruzadores_posicoes);
    }

    for (i = 0; i < cruzadores_qtd; i++) {
        for (j = 0; j < cruzadores_posicoes; j++) {
            cruzadores[i].posicoes[j].lin = linha;
            cruzadores[i].posicoes[j].col = coluna;
            cruzadores[i].posicoes[j].acertou = 0;
            //escreverMatriz(linha, coluna, '0');
            escreverMatriz(linha, coluna, 'c');
            coluna++;
        }

        if ((i + 1) < cruzadores_qtd) {
            linha = getPosicao();
            coluna = getPosicao();
            posicaoValida = isPosicaoValida(&linha, &coluna, cruzadores_posicoes);
            while (!posicaoValida) {
                posicaoValida = isPosicaoValida(&linha, &coluna, cruzadores_posicoes);
            }
        }
    }
}

void quebraLinha() {
    UART1_Write(13);
    UART1_Write(10);
}

void initRandom() {
    UART1_Write_Text("Pressione uma tecla ");
    while (1) {
        random++;
        while (!UART1_Data_Ready()) {
            random++;
        }
        UART1_Read_Text(input_config, ENTER, 30);
        tecla = atoi(input_config);
        if (tecla != 255) {
            srand(random);
            break;
        }
    }
    quebraLinha();
}

void imprimirMatriz(unsigned int isImprimirTelaInicial, unsigned int isImprimirRespostas) {
    unsigned int i = 0;
    unsigned int j = 0;
    unsigned char letra_A = 65;
    unsigned char printLetra = 0;
    signed int valorPosicao = 0;
    /*
    UART1_Write_Text("|   |");
    UART1_Write_Text(" 1 |");
    UART1_Write_Text(" 2 |");
    UART1_Write_Text(" 3 |");
    UART1_Write_Text(" 4 |");
    UART1_Write_Text(" 5 |");
    UART1_Write_Text(" 6 |");
    UART1_Write_Text(" 7 |");
    UART1_Write_Text(" 8 |");
    UART1_Write_Text(" 9 |");
    UART1_Write_Text(" 10 |");
    UART1_Write_Text(" 11 |");
    UART1_Write_Text(" 12 |");
    UART1_Write_Text(" 13 |");
    UART1_Write_Text(" 14 |");
    UART1_Write_Text(" 15 |");
    quebraLinha();
     */

    for (i = 0; i < tamanho_matriz; i++) {
        // UART1_Write_Text("| ");
        printLetra = letra_A + i;
        // UART1_Write(printLetra);
        // UART1_Write_Text(" |");
        for (j = 0; j < tamanho_matriz; j++) {
            valorPosicao = matriz[i][j];
            // UART1_Write(' ');       // -1 C c .
            // if (valorPosicao == -1 || valorPosicao == 0 || isImprimirTelaInicial) {                                        
                        if((valorPosicao == -1) || isImprimirTelaInicial) {
							// UART1_Write('~');
                        } else {
                                if (isImprimirRespostas || (valorPosicao >= 65 && valorPosicao <= 90) || (valorPosicao == 46)) {
                                    // UART1_Write(valorPosicao);
                                } else {
                                        if (valorPosicao >= 97 && valorPosicao <= 122) {
                                            // UART1_Write('~');
                                        } else {
                                            // UART1_Write('X');
                                        }
                                }
                        }
            // UART1_Write_Text(" |");
        }
        quebraLinha();
    }
}

