FelipeCorso/PIC18F4620-batalha-naval/batalha_naval.c
void imprimirPontuacao() {
    unsigned char encouracados_acertos_print[7];
    unsigned int encouracados_restante_qtd = 0;
    unsigned char encouracados_restante_print[7];

    unsigned char porta_avioes_acertos_print[7];
    unsigned int porta_avioes_restante_qtd = 0;
    unsigned char porta_avioes_restante_print[7];

    unsigned char hidroavioes_acertos_print[7];
    unsigned int hidroavioes_restante_qtd = 0;
    unsigned char hidroavioes_restante_print[7];

    unsigned char submarinos_acertos_print[7];
    unsigned int submarinos_restante_qtd = 0;
    unsigned char submarinos_restante_print[7];

    unsigned char cruzadores_acertos_print[7];
    unsigned int cruzadores_restante_qtd = 0;
    unsigned char cruzadores_restante_print[7];

    unsigned int total_acertos_qtd = 0;
    unsigned char total_acertos_print[7];
    unsigned int total_restante_qtd = 0;
    unsigned char total_restante_print[7];

    IntToStr(encouracados_acertos, encouracados_acertos_print);
    encouracados_restante_qtd = encouracados_qtd - encouracados_acertos;
    IntToStr(encouracados_restante_qtd, encouracados_restante_print);

    IntToStr(porta_avioes_acertos, porta_avioes_acertos_print);
    porta_avioes_restante_qtd = porta_avioes_qtd - porta_avioes_acertos;
    IntToStr(porta_avioes_restante_qtd, porta_avioes_restante_print);

    IntToStr(hidroavioes_acertos, hidroavioes_acertos_print);
    hidroavioes_restante_qtd = hidroavioes_qtd - hidroavioes_acertos;
    IntToStr(hidroavioes_restante_qtd, hidroavioes_restante_print);

    IntToStr(submarinos_acertos, submarinos_acertos_print);
    submarinos_restante_qtd = submarinos_qtd - submarinos_acertos;
    IntToStr(submarinos_restante_qtd, submarinos_restante_print);

    IntToStr(cruzadores_acertos, cruzadores_acertos_print);
    cruzadores_restante_qtd = cruzadores_qtd - cruzadores_acertos;
    IntToStr(cruzadores_restante_qtd, cruzadores_restante_print);

    total_acertos_qtd = encouracados_acertos + porta_avioes_acertos + hidroavioes_acertos + submarinos_acertos + cruzadores_acertos;
    IntToStr(total_acertos_qtd, total_acertos_print);
    total_restante_qtd = 15 - total_acertos_qtd;
    IntToStr(total_restante_qtd, total_restante_print);

    UART1_Write_Text("| Qtd |");
    UART1_Write_Text(" Formato |");
    UART1_Write_Text(" Acertos |");
    UART1_Write_Text(" Restam |");

    quebraLinha();

    UART1_Write_Text("|  2  |");
    UART1_Write_Text(" XXXXX   | ");
    UART1_Write_Text(encouracados_acertos_print);
    UART1_Write_Text(" | ");
    UART1_Write_Text(encouracados_restante_print);
    UART1_Write_Text(" |");

    quebraLinha();

    UART1_Write_Text("|  1  |");
    UART1_Write_Text(" XXXXXX  | ");
    UART1_Write_Text(porta_avioes_acertos_print);
    UART1_Write_Text(" | ");
    UART1_Write_Text(porta_avioes_restante_print);
    UART1_Write_Text(" |");

    quebraLinha();

    UART1_Write_Text("|  5  |");
    UART1_Write_Text(" XXX     | ");
    UART1_Write_Text(hidroavioes_acertos_print);
    UART1_Write_Text(" | ");
    UART1_Write_Text(hidroavioes_restante_print);
    UART1_Write_Text(" |");

    quebraLinha();

    UART1_Write_Text("|  4  |");
    UART1_Write_Text(" X       | ");
    UART1_Write_Text(submarinos_acertos_print);
    UART1_Write_Text(" | ");
    UART1_Write_Text(submarinos_restante_print);
    UART1_Write_Text(" |");

    quebraLinha();

    UART1_Write_Text("|  3  |");
    UART1_Write_Text(" XX      | ");
    UART1_Write_Text(cruzadores_acertos_print);
    UART1_Write_Text(" | ");
    UART1_Write_Text(cruzadores_restante_print);
    UART1_Write_Text(" |");

    quebraLinha();

    UART1_Write_Text("| 15 |");
    UART1_Write_Text("  TOTAL  | ");
    UART1_Write_Text(total_acertos_print);
    UART1_Write_Text(" | ");
    UART1_Write_Text(total_restante_print);
    UART1_Write_Text(" |");

    quebraLinha();
}

unsigned int isGanhou() {
    unsigned int total_acertos_qtd = 0;
    total_acertos_qtd = encouracados_acertos + porta_avioes_acertos + hidroavioes_acertos + submarinos_acertos + cruzadores_acertos;
    return total_acertos_qtd == 15;
}

void executarSomAcertou() {
    Sound_Init(&PORTC, 2);
    Sound_Play(880, 500);
}

void executarSomErrou() {
    Sound_Init(&PORTC, 2);
    Sound_Play(580, 500);
}

void executarSomAfundou() {
    Sound_Init(&PORTC, 2);
    Sound_Play(880, 1000);
}

void executarSomGanhou() {
    Sound_Init(&PORTC, 2);
    Sound_Play(980, 1000);
}

void executarSomPerdeu() {
    Sound_Init(&PORTC, 2);
    Sound_Play(380, 1000);
}

unsigned int isAcertouEncouracado(unsigned int linha, unsigned int coluna) {
    unsigned int i = 0;
    unsigned int j = 0;
    for (i = 0; i < encouracados_qtd; i++) {
        for (j = 0; j < encouracados_posicoes; j++) {
            if (encouracados[i].posicoes[j].lin == linha &&
                    encouracados[i].posicoes[j].col == coluna &&
                    encouracados[i].posicoes[j].acertou == 0) {
                encouracados[i].posicoes[j].acertou = 1;
                return i;
            }
        }
    }
    return -1;
}

unsigned int isAfundouEncouracado(unsigned int encouracadoAcertado) {
    unsigned int j = 0;
    for (j = 0; j < encouracados_posicoes; j++) {
        if (encouracados[encouracadoAcertado].posicoes[j].acertou != 1) {
            return 0;
        }
    }
    return 1;
}

unsigned int isAcertouPortaAvioes(unsigned int linha, unsigned int coluna) {
    unsigned int i = 0;
    unsigned int j = 0;
    for (i = 0; i < porta_avioes_qtd; i++) {
        for (j = 0; j < porta_avioes_posicoes; j++) {
            if (porta_avioes[i].posicoes[j].lin == linha &&
                    porta_avioes[i].posicoes[j].col == coluna &&
                    porta_avioes[i].posicoes[j].acertou == 0) {
                porta_avioes[i].posicoes[j].acertou = 1;
                return i;
            }
        }
    }
    return -1;
}

unsigned int isAfundouPortaAvioes(unsigned int portaAvioesAcertado) {
    unsigned int j = 0;
    for (j = 0; j < porta_avioes_posicoes; j++) {
        if (porta_avioes[portaAvioesAcertado].posicoes[j].acertou != 1) {
            return 0;
        }
    }
    return 1;
}

unsigned int isAcertouHidroAviao(unsigned int linha, unsigned int coluna) {
    unsigned int i = 0;
    unsigned int j = 0;
    for (i = 0; i < hidroavioes_qtd; i++) {
        for (j = 0; j < hidroavioes_posicoes; j++) {
            if (hidroavioes[i].posicoes[j].lin == linha &&
                    hidroavioes[i].posicoes[j].col == coluna &&
                    hidroavioes[i].posicoes[j].acertou == 0) {
                hidroavioes[i].posicoes[j].acertou = 1;
                return i;
            }
        }
    }
    return -1;
}

unsigned int isAfundouHidroAviao(unsigned int hidroAviaoAcertado) {
    unsigned int j = 0;
    for (j = 0; j < hidroavioes_posicoes; j++) {
        if (hidroavioes[hidroAviaoAcertado].posicoes[j].acertou != 1) {
            return 0;
        }
    }
    return 1;
}

unsigned int isAcertouSubmarino(unsigned int linha, unsigned int coluna) {
    unsigned int i = 0;
    unsigned int j = 0;
    for (i = 0; i < submarinos_qtd; i++) {
        for (j = 0; j < submarinos_posicoes; j++) {
            if (submarinos[i].posicoes[j].lin == linha &&
                    submarinos[i].posicoes[j].col == coluna &&
                    submarinos[i].posicoes[j].acertou == 0) {
                submarinos[i].posicoes[j].acertou = 1;
                return i;
            }
        }
    }
    return -1;
}

